import DescrBlock from "./DescrBlock"
// import bgSvg from '../../public/bg-svg-atr-ph.svg'

const articlesBlockInfo = [
    {
        headerText: 'Классические пристенные ванны',
        desText: 'Это самый распространённый вариант, который устанавливается вдоль одной из стен ванной комнаты. Такие ванны могут иметь прямоугольную или овальную форму и подходят как для небольших, так и просторных помещений.',
        pluses: [
            'Экономия пространства за счёт расположения у стены.',
            'Доступная цена и широкий выбор моделей.',
            'Простота установки и подключения к водопроводу.'
        ],
        minuses: [
            'Доступ к ванне ограничен с трёх сторон, что может усложнить уход.',
            'Меньший визуальный эффект по сравнению с отдельно стоящими ваннами.'
        ]
    },
    {
        headerText: 'Угловые ванны: компактность и удобство',
        desText: 'Угловые ванны идеально подходят для небольших ванных комнат, так как эффективно используют угловое пространство. Они бывают как симметричными, так и асимметричными (левая/правая ориентация).',
        pluses: [
            'Оптимизация пространства, особенно в маленьких помещениях.',
            'Улучшенная эргономика – некоторые модели имеют специальные углубления для сидения.',
            'Эстетический дизайн, который делает ванную комнату стильной.'
        ],
        minuses: [
            'Часто имеют меньший внутренний объём, чем классические ванны.',
            'Сложность монтажа, особенно если ванна имеет встроенные полки или сиденья.'
        ]
    },
    {
        headerText: 'Отдельно стоящие ванны: стиль и роскошь',
        desText: 'Этот вариант выбирают для просторных ванных комнат или интерьеров в стиле минимализм, ретро и лофт. Такие ванны могут устанавливаться в центре комнаты или рядом с окном.',
        pluses: [
            'Эффектный внешний вид, создающий атмосферу СПА-салона.',
            'Свобода в расположении, так как не требует прилегания к стене.',
            'Широкий выбор форм: овальные, круглые, каплевидные и даже квадратные модели.'
        ],
        minuses: [
            'Требует много места, поэтому не подходит для маленьких ванных.',
            'Дороже в установке из-за необходимости подвода коммуникаций через пол.'
        ]
    },
    {
        headerText: 'Гидромассажные ванны: максимальный комфорт',
        desText: 'Гидромассажные ванны оснащены встроенной системой форсунок, которые создают массажный эффект благодаря циркуляции воды и воздуха. Такие ванны рекомендуются для расслабления мышц и улучшения кровообращения.',
        pluses: [
            'Терапевтический эффект – снимает напряжение, улучшает кровоток.',
            'Возможность настройки режимов массажа (аэромассаж, гидромассаж, комбинированный).',
            'Современные модели оснащены LED-подсветкой и системой ароматерапии.'
        ],
        minuses: [
            'Высокая стоимость как самой ванны, так и её обслуживания.',
            'Требует более сложного монтажа, подключения к электросети и специального ухода за форсунками.'
        ]
    }
];


export default function Article1(){
    return <>
        <section id="article1">
            <div className="container" >
                <h1 className="text-title" >Как выбрать идеальную ванну: формы, функции, удобство.</h1>

                <div style={{display:'flex'}}>
                    <article className="text" style={{display:'flex', flexDirection:'column', gap:20}}>

                        <p style={{width:'100%', lineClamp:2, textIndent:10}}>
                            Выбор сантехники для ванной комнаты – это важный этап, 
                            который определяет не только удобство, но и общий стиль помещения. 
                            Современный рынок предлагает множество решений, которые различаются по форме, материалам, функциональности и даже технологиям. 
                            Чтобы сделать правильный выбор, важно понимать, какие элементы сантехники необходимы для комфортного пользования ванной.
                        </p>
                    
                        <article style={{display:'flex',width:'100%', lineClamp:2, textIndent:10}}>
                            <p style={{display:'flex', flexDirection:'column', gap:20, width:'60%'}}>
                                Ванны являются центральным элементом комнаты и могут быть классическими пристенными, угловыми для экономии пространства, отдельно стоящими для создания роскошного интерьера или оснащенными функцией гидромассажа для полного расслабления.

                                {articlesBlockInfo.map((art, index) => <DescrBlock key={index} index ={index+1} {...art}/>)}
                            </p>
                            
                            <div className="bg-art-ph" style={{width:'40%', padding:'10px 0', boxSizing:'border-box', display:'flex', flexDirection:'column', gap:20}}>
                                <img className="art-ph-size" style={{borderRadius:15, alignSelf:'start' , boxShadow:'inset 0px 0px 10px #000000;'}} src={'/img/acrticle1photo.png'} alt="vanna"/>

                                <img className="art-ph-size" style={{borderRadius:15 , alignSelf:'end', boxShadow:'inset 0px 0px 10px #000000;'}} src={'/img/articlevanna2.png'} alt="vanna"/>

                                <img className="art-ph-size" style={{borderRadius:15, alignSelf:'start', boxShadow:'inset 0px 0px 10px #000000;' }} src={'/img/artvanna3.png'} alt='vanna'/>
                            </div>
                            


                    </article>

                    {/* <svg style={{width:'40%'}}  viewBox="0 0 678 209" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <g filter="url(#filter0_d_2508_7045)">
                            <path d="M247.713 9H446.216L668 198H10L247.713 9Z" fill="#0D1115"/>
                            </g>
                            <foreignObject width="200" height="116" x={228} y={50}>
                                <svg viewBox="0 0 200 116" fill="#7880B5" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M3.2792e-06 35.332C3.2792e-06 32.5806 2.2304 30.3502 4.98175 30.3502H169.878V9.96349H154.221V19.2651C154.221 22.0165 151.99 24.2469 149.239 24.2469C146.488 24.2469 144.257 22.0165 144.257 19.2651V4.98175C144.257 2.2304 146.488 0 149.239 0H174.859C177.611 0 179.841 2.2304 179.841 4.98175V30.3502H195.018C197.77 30.3502 200 32.5806 200 35.332C200 66.6088 181.201 93.5736 154.311 105.532L155.845 106.173C158.383 107.234 159.581 110.152 158.52 112.691C157.721 114.601 155.87 115.752 153.922 115.752C153.281 115.752 152.63 115.628 152.002 115.366L139.868 110.293C134.504 111.484 128.932 112.118 123.214 112.118H76.7858C70.0106 112.118 63.4397 111.232 57.1776 109.576L43.3291 115.366C42.7014 115.628 42.0502 115.752 41.4097 115.752C39.4611 115.752 37.6101 114.601 36.8115 112.691C35.7504 110.152 36.9482 107.234 39.4867 106.173L43.4714 104.507C17.7699 92.0797 3.2792e-06 65.742 3.2792e-06 35.332ZM76.7858 102.154H123.214C158.384 102.154 187.296 74.8422 189.852 40.313H10.1464C12.7034 74.8429 41.6154 102.154 76.7858 102.154Z" />
                                </svg>
                            </foreignObject>

                            <foreignObject width="72" height="117" x={440} y={-38}>
                                <svg  viewBox="0 0 72 117" fill="#A9A4A4" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M69.8921 0H1.51414C0.678005 0 0 0.677776 0 1.51414V109.681C0 110.517 0.678233 111.195 1.51414 111.195H3.39962V115.485C3.39962 116.322 4.07786 117 4.91376 117H13.4945C14.3307 117 15.0087 116.321 15.0087 115.485V111.195H56.3978V115.485C56.3978 116.322 57.076 117 57.9119 117H66.4927C67.3288 117 68.0068 116.321 68.0068 115.485V111.195H69.8921C70.7282 111.195 71.4062 110.517 71.4062 109.681V1.51414C71.4062 0.677776 70.728 0 69.8921 0ZM11.9801 113.971H6.42791V111.195H11.9801V113.971ZM64.9783 113.971H59.4261V111.195H64.9783V113.971ZM68.3777 108.167H3.02851V3.02851H68.3777V108.167Z" />
                                    <path d="M6.46727 104.679H64.9366C65.7729 104.679 66.4507 104.001 66.4507 103.165V8.03074C66.4507 7.19438 65.7729 6.5166 64.9366 6.5166H6.46727C5.6309 6.5166 4.95313 7.19438 4.95313 8.03074V103.165C4.9529 104.001 5.6309 104.679 6.46727 104.679ZM7.98118 9.54489H63.4227V101.651H13.6801V66.0309H19.3507C20.1871 66.0309 20.8649 65.3527 20.8649 64.5168V58.0763C20.8649 57.2399 20.1871 56.5621 19.3507 56.5621H13.6801V46.707H18.9015C21.0852 46.707 23.113 45.6211 24.3255 43.8018C24.7894 43.1058 24.6013 42.1657 23.9055 41.702C23.2092 41.2379 22.2696 41.4262 21.8057 42.122C21.1555 43.0966 20.0701 43.6787 18.9015 43.6787H13.6801V22.4009C13.6801 19.8196 15.779 17.7193 18.3587 17.7193H34.5865C36.7275 17.7193 38.5325 19.1668 39.0867 21.134H30.2884C27.5208 21.134 25.2688 23.3861 25.2688 26.1538V28.5944C25.2688 29.4307 25.9466 30.1085 26.783 30.1085H54.7786C55.615 30.1085 56.2927 29.4307 56.2927 28.5944V26.1538C56.2927 23.3861 54.0396 21.134 51.2702 21.134H42.1879C41.5816 17.4835 38.4046 14.6911 34.5861 14.6911H18.3583C14.1086 14.6911 10.6512 18.1499 10.6512 22.4009V101.651H7.98095V9.54489H7.98118ZM13.6801 63.0026V59.5904H17.8364V63.0026H13.6801ZM51.2707 24.1623C52.3703 24.1623 53.2647 25.0558 53.2647 26.1536V27.0798H28.2973V26.1536C28.2973 25.0558 29.1904 24.1623 30.2886 24.1623H51.2707Z" />
                                    <path d="M51.604 86.3867C50.7679 86.3867 50.0898 87.0649 50.0898 87.9009V96.7339C50.0898 97.57 50.7681 98.248 51.604 98.248C52.4404 98.248 53.1181 97.5698 53.1181 96.7339V87.9009C53.1181 87.0649 52.4401 86.3867 51.604 86.3867Z" />
                                    <path d="M51.604 59.1309C50.7679 59.1309 50.0898 59.8091 50.0898 60.645V81.3396C50.0898 82.1757 50.7681 82.8537 51.604 82.8537C52.4404 82.8537 53.1181 82.1757 53.1181 81.3396V60.645C53.1181 59.8091 52.4401 59.1309 51.604 59.1309Z" />
                                    <path d="M51.604 31.874C50.7679 31.874 50.0898 32.5523 50.0898 33.3882V54.5875C50.0898 55.4237 50.7681 56.1017 51.604 56.1017C52.4404 56.1017 53.1181 55.4237 53.1181 54.5875V33.3882C53.1181 32.552 52.4401 31.874 51.604 31.874Z" />
                                    <path d="M44.1977 75.5352C43.3616 75.5352 42.6836 76.2134 42.6836 77.0493V96.7343C42.6836 97.5704 43.3618 98.2484 44.1977 98.2484C45.0341 98.2484 45.7119 97.5702 45.7119 96.7343V77.0493C45.7121 76.2134 45.0339 75.5352 44.1977 75.5352Z" />
                                    <path d="M44.1977 48.0264C43.3616 48.0264 42.6836 48.7046 42.6836 49.5405V65.9447C42.6836 66.7808 43.3618 67.4588 44.1977 67.4588C45.0341 67.4588 45.7119 66.7808 45.7119 65.9447V49.5405C45.7121 48.7046 45.0339 48.0264 44.1977 48.0264Z" />
                                    <path d="M44.198 72.936C44.5967 72.936 44.9879 72.7744 45.2706 72.4917C45.5506 72.2116 45.7123 71.8204 45.7123 71.4216C45.7123 71.0228 45.5506 70.6316 45.2706 70.3515C44.9879 70.0688 44.5967 69.9072 44.198 69.9072C43.7992 69.9072 43.4105 70.0688 43.1278 70.3515C42.8452 70.6341 42.6836 71.0228 42.6836 71.4216C42.6836 71.8204 42.8452 72.2116 43.1278 72.4917C43.4105 72.7744 43.7992 72.936 44.198 72.936Z" />
                                    <path d="M44.1977 31.874C43.3616 31.874 42.6836 32.5523 42.6836 33.3882V42.726C42.6836 43.5621 43.3618 44.2401 44.1977 44.2401C45.0341 44.2401 45.7119 43.5619 45.7119 42.726V33.3882C45.7121 32.552 45.0339 31.874 44.1977 31.874Z" />
                                    <path d="M36.7954 58.1211C35.9593 58.1211 35.2812 58.7993 35.2812 59.6352V96.734C35.2812 97.5702 35.9595 98.2482 36.7954 98.2482C37.6318 98.2482 38.3095 97.5699 38.3095 96.734V59.6355C38.3095 58.7993 37.6315 58.1211 36.7954 58.1211Z" />
                                    <path d="M36.7954 31.874C35.9593 31.874 35.2812 32.5523 35.2812 33.3882V53.578C35.2812 54.4141 35.9595 55.0921 36.7954 55.0921C37.6318 55.0921 38.3095 54.4141 38.3095 53.578V33.3882C38.3095 32.552 37.6315 31.874 36.7954 31.874Z" />
                                    <path d="M29.3931 87.6484C28.5569 87.6484 27.8789 88.3267 27.8789 89.1626V96.7337C27.8789 97.5699 28.5571 98.2479 29.3931 98.2479C30.2294 98.2479 30.9072 97.5697 30.9072 96.7337V89.1626C30.9074 88.3267 30.2292 87.6484 29.3931 87.6484Z" />
                                    <path d="M29.3931 44.2402C28.5569 44.2402 27.8789 44.9185 27.8789 45.7544V82.6009C27.8789 83.437 28.5571 84.115 29.3931 84.115C30.2294 84.115 30.9072 83.4372 30.9072 82.6009V45.7546C30.9074 44.9185 30.2292 44.2402 29.3931 44.2402Z" />
                                    <path d="M29.3931 31.874C28.5569 31.874 27.8789 32.5523 27.8789 33.3882V39.9498C27.8789 40.7859 28.5571 41.4639 29.3931 41.4639C30.2294 41.4639 30.9072 40.7857 30.9072 39.9498V33.3882C30.9074 32.552 30.2292 31.874 29.3931 31.874Z" />
                                </svg>
                            </foreignObject>
                            <foreignObject width={68} height={85} x={170} y={-15}>
                                <svg  viewBox="0 0 68 85" fill="#A9A4A4" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M14.906 17.2475C14.906 16.5499 15.4724 15.9904 16.1631 15.9904C16.8607 15.9904 17.4202 16.5568 17.4202 17.2475V40.2696C17.4202 40.9672 16.8538 41.5267 16.1631 41.5267H1.25713C0.566399 41.5336 0 40.9672 0 40.2765V2.70766C0 1.96858 0.303921 1.29167 0.794339 0.794339L0.801247 0.787432C1.29857 0.303921 1.96858 0 2.71457 0H14.7125C15.4516 0 16.1355 0.303921 16.6259 0.801247C17.1163 1.29167 17.4202 1.96858 17.4202 2.71457V5.90574C17.4202 6.60338 16.8538 7.16287 16.1631 7.16287C15.4654 7.16287 14.906 6.59647 14.906 5.90574V2.70766C14.906 2.65931 14.8852 2.61096 14.8507 2.56952C14.8162 2.53498 14.7678 2.51426 14.7125 2.51426H2.71457C2.65931 2.51426 2.61096 2.53498 2.57642 2.56952L2.56952 2.57642C2.53498 2.61096 2.51426 2.65931 2.51426 2.71457V39.0193H14.906V17.2475ZM14.899 68.9901L0.145053 40.8567C-0.172683 40.2419 0.0621657 39.489 0.676915 39.1644C0.863412 39.0677 1.06372 39.0193 1.25713 39.0193V39.0124H66.5518C67.2495 39.0124 67.809 39.5788 67.809 40.2696C67.809 40.3179 67.809 40.3663 67.8021 40.4146C67.4498 55.4311 60.0866 59.6583 53.8907 63.2087C50.2713 65.2878 47.1009 67.1044 46.5069 70.9518L46.4999 70.9863C46.272 72.4921 46.3963 74.2189 46.8729 76.1737C47.3703 78.2113 48.2475 80.5046 49.5253 83.0534C49.8362 83.675 49.5806 84.4279 48.9589 84.7388C48.7793 84.8285 48.5859 84.87 48.3994 84.87H8.9864C8.28876 84.87 7.72927 84.3036 7.72927 83.6129C7.72927 83.3711 7.79834 83.1432 7.92267 82.9498L14.899 68.9901ZM3.33623 41.5336L17.4202 68.3961C17.5998 68.7414 17.6136 69.1628 17.4271 69.5358L11.0171 82.3626H46.4101C45.5122 80.3664 44.856 78.5015 44.4347 76.7746C43.8752 74.4814 43.737 72.4299 44.0133 70.6202L44.0202 70.5788C44.8007 65.5365 48.4616 63.4366 52.6405 61.0398C58.1111 57.9039 64.5833 54.1878 65.2533 41.5405H3.33623V41.5336ZM16.3081 70.2334C15.6105 70.2334 15.051 69.667 15.051 68.9763C15.051 68.2787 15.6174 67.7192 16.3081 67.7192H30.0468C30.7444 67.7192 31.3039 68.2856 31.3039 68.9763C31.3039 69.6739 30.7375 70.2334 30.0468 70.2334H16.3081ZM17.4133 40.463C17.3097 41.1468 16.6673 41.6234 15.9835 41.5198C15.2997 41.4162 14.8231 40.7738 14.9267 40.09C15.127 38.7914 15.4516 37.6172 15.9075 36.588C16.3841 35.5173 16.9989 34.6125 17.7518 33.8734C20.1969 31.4835 23.3052 31.5387 26.2754 31.594C26.5378 31.6009 26.7934 31.6009 27.4634 31.6009H54.3743C60.7566 31.5595 67.8297 31.5111 67.7951 40.5804C67.7951 41.2711 67.2357 41.8306 66.5449 41.8306C65.8542 41.8306 65.2947 41.2711 65.2947 40.5804C65.3223 34.0323 59.5755 34.0737 54.395 34.1082C53.6145 34.1152 53.6352 34.1221 53.1724 34.1221H27.4703L26.2408 34.1013C23.7818 34.0599 21.2054 34.0115 19.5062 35.6762C18.9744 36.1943 18.5461 36.8366 18.2007 37.6033C17.8416 38.4046 17.5791 39.3578 17.4133 40.463ZM10.5889 7.71545C12.5437 7.71545 14.1254 9.29723 14.1254 11.252C14.1254 13.2068 12.5437 14.7885 10.5889 14.7885C8.63412 14.7885 7.05235 13.2068 7.05235 11.252C7.05235 9.29723 8.64103 7.71545 10.5889 7.71545ZM14.1254 12.5091C13.4278 12.5091 12.8683 11.9427 12.8683 11.252C12.8683 10.5544 13.4347 9.99486 14.1254 9.99486H22.6076C23.3052 9.99486 23.8647 10.5613 23.8647 11.252C23.8647 11.9496 23.2983 12.5091 22.6076 12.5091H14.1254Z" />
                                </svg>
                            </foreignObject>
                            <foreignObject width={43} height={50} x={310} y={-35}>
                                <svg  viewBox="0 0 43 50" fill="#A9A4A4" xmlns="http://www.w3.org/2000/svg">
                                    <path d="M16.8086 0C13.783 0 11.3086 2.47442 11.3086 5.5V6H10.3086V8H14.3086V6H13.3086V5.5C13.3086 3.55558 14.8642 2 16.8086 2C18.753 2 20.3086 3.55558 20.3086 5.5V17H18.3086V14H14.3086L15.3086 17H0L0.34375 18.2637C2.11057 24.7424 7.78431 29.21 14.3809 29.7793L16.4043 50H26.2129L26.3027 49.0996L28.2363 29.7793C34.8329 29.21 40.5066 24.7424 42.2734 18.2637L42.6172 17H27.3086L28.3086 14H24.3086V17H22.3086V5.5C22.3086 2.47442 19.8342 0 16.8086 0ZM2.85547 19H39.7617C37.7105 24.3291 32.7148 28 26.9062 28H15.7109C9.9024 28 4.90666 24.3291 2.85547 19ZM16.4121 30H26.2051L24.4043 48H18.2129L16.4121 30Z" />
                                </svg>

                            </foreignObject>
                            <defs>
                                <filter  id="filter0_d_2508_7045" x="0" y="0" width="678" height="209" filterUnits="userSpaceOnUse" color-interpolation-filters="sRGB">
                                    <feFlood flood-opacity="0" result="BackgroundImageFix"/>
                                    <feColorMatrix in="SourceAlpha" type="matrix" values="0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 0 127 0" result="hardAlpha"/>
                                    <feOffset dy="1"/>
                                    <feGaussianBlur stdDeviation="5"/>
                                    <feComposite in2="hardAlpha" operator="out"/>
                                    <feColorMatrix type="matrix" values="0 0 0 0 0.866113 0 0 0 0 0.802043 0 0 0 0 0.802043 0 0 0 0.44 0"/>
                                    <feBlend mode="normal" in2="BackgroundImageFix" result="effect1_dropShadow_2508_7045"/>
                                    <feBlend mode="normal" in="SourceGraphic" in2="effect1_dropShadow_2508_7045" result="shape"/>
                                </filter>
                            </defs>
                        </svg> */}
                    
                    {/* <p style={{width:'100%', lineClamp:2, textIndent:10}}>                    
                        Душевые кабины подойдут для тех, кто предпочитает компактные и функциональные решения. Они бывают открытого типа, с минималистичными перегородками, или закрытого типа, с герметичными дверями и множеством дополнительных функций, таких как гидромассаж, ароматерапия и парогенерация.
                    </p>

                    <p style={{width:'100%', lineClamp:2, textIndent:10}}>
                        Раковины играют важную роль в эргономике ванной комнаты. Они могут быть накладными, устанавливаемыми на столешницу, встраиваемыми для более лаконичного вида, напольными в современных интерьерах или подвесными, что создает ощущение легкости и простора.
                    </p>

                    <p style={{width:'100%', lineClamp:2, textIndent:10}}>
                        Унитазы и биде также бывают разных типов: компактные напольные модели, подвесные конструкции для визуального увеличения пространства, приставные варианты и модели с интегрированными функциями, такими как подогрев сиденья или автоматический слив.
                    </p>

                    <p style={{width:'100%', lineClamp:2, textIndent:10}}>
                        Смесители – это не просто источник воды, но и важный элемент удобства. Классические варианты подойдут для большинства интерьеров, термостатические помогут избежать перепадов температуры, а сенсорные обеспечат максимальную гигиеничность и экономию воды.
                    </p> */}
                    </article>
                    
                   

                    {/* <div className="img-acrticle1-wp">
                        <div>
                            <img src="" alt="" />
                        </div>
                        <div>
                            <img src="" alt="" />
                            <img src="" alt="" />
                        </div>
                    </div> */}
                </div>
                
            </div>
        </section>
    </>
}